tap "homebrew/bundle"
tap "homebrew/services"
tap "tw93/tap"
# Run your GitHub Actions locally
brew "act"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Code searching, linting, rewriting
brew "ast-grep"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Secure runtime for JavaScript and TypeScript
brew "deno", link: false
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Modern, maintained replacement for ls
brew "eza"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Render markdown on the CLI
brew "glow"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: :changed
# Small build system for use with gyp or CMake
brew "ninja"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Cut and paste files in Finder
cask "command-x"
# Database version management tool
cask "dbngin"
# Utility to enhance the Open and Save dialogs in applications
cask "default-folder-x"
# Voice and text chat software
cask "discord"
# Web browser
cask "google-chrome"
# Menu bar manager
cask "jordanbaird-ice"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Tinker tool for PHP and Laravel developers
cask "tinkerwell"
# Open-source code editor
cask "visual-studio-code"
# Voice to text app
cask "voiceink"
# System tray app for automatic time tracking
cask "wakatime"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# Multiplayer code editor
cask "zed"
